src/CF/Catalogs/ПодключаемоеОборудование.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.1">
	<Catalog>
		<Properties>
			<Name>ПодключаемоеОборудование</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВерсияКомпоненты</Name>
					<Comment>Версия компоненты</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>16</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторУстройства</Name>
					<Comment>Уникальный идентификатор устройства стандарта оборудования</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоОтключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УстройствоИспользуется</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбработчикДрайвера</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОбработчикиДрайверовПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Параметры</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочееМесто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РабочиеМеста</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОборудования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыПодключаемогоОборудования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПереустановка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CF/Catalogs/ПодключаемоеОборудование/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

	// Процедура производит инициализацию параметров устройства.
	//
	Процедура ПередЗаписью(Отказ)

		Если НЕ Отказ
			И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА) Тогда

			Если ОбменДанными.Загрузка Тогда
				Возврат;
			КонецЕсли;

			УстройствоОтключено = НЕ УстройствоИспользуется;

			Если ЭтоНовый() Тогда
				Параметры = Новый ХранилищеЗначения(Новый Структура());
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры // ПередЗаписью()

	// Процедура проверяет уникальность наименования элемента справочника
	// для данного компьютера.
	Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)

		Если НЕ Отказ
			И НЕ ОбщийМодульПовтор.ПолучитьЗначениеНастройкиИлиКонстанты("МассоваяЗагрузка", ИСТИНА)
			И НЕ ПустаяСтрока(Наименование) Тогда

			Запрос = Новый Запрос(" ВЫБРАТЬ 1
			|ИЗ Справочник.ПодключаемоеОборудование КАК ПодключаемоеОборудование
			|ГДЕ ПодключаемоеОборудование.Наименование = &Наименование
			|    И ПодключаемоеОборудование.РабочееМесто = &РабочееМесто
			|    И ПодключаемоеОборудование.Ссылка <> &Ссылка");
			Запрос.УстановитьПараметр("Наименование", Наименование);
			Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);
			Запрос.УстановитьПараметр("Ссылка"      , Ссылка);

			Если НЕ Запрос.Выполнить().Пустой() Тогда
				Попытка // ЭтотОбъект
					ОбщегоНазначения.СообщитьПользователю(ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("Указано неуникальное наименование элемента. Укажите уникальное наименование."), ЭтотОбъект, , , Отказ);
				Исключение
				КонецПопытки;
			КонецЕсли;
		КонецЕсли;

	КонецПроцедуры // ОбработкаПроверкиЗаполнения()

	// Процедура производит очистку реквизитов, которые не должны копироваться.
	// Следующие реквизиты очищаются при копировании:
	// "УстройствоОтключено" - устанавливается для нового устройства в ЛОЖЬ;
	// "Параметры"      - параметры устройства сбрасываются в Неопределено;
	// "Наименование"   - устанавливается отличное от исходного наименования;
	Процедура ПриКопировании(ОбъектКопирования)

		УстройствоОтключено = ЛОЖЬ;
		УстройствоИспользуется = ИСТИНА;
		Параметры = Неопределено;
		Наименование = "%Наименование% (" + ОбщийМодульПовтор.ПолучитьТекстНаЯзыке("копия") + ")";
		Наименование = СтрЗаменить(Наименование, "%Наименование%", ОбъектКопирования.Наименование);

	КонецПроцедуры

	// При записи
	//
	Процедура ПриЗаписи(Отказ)

		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;

	КонецПроцедуры

#КонецЕсли
